/**************************************************************************

						КОНСТАНТЫ АТРИБУТОВ

  Минимально необходимые (ATR_MIN), достаточные для 100% успеха (ATR_100)
и т.п.
  
***************************************************************************/

// ОБУЧЕНИЕ --------------------------------------------------------------

const int DEX_MIN_Teach_RepairClothes	= 20;

// УСПЕШНОСТЬ ОПЕРАЦИИ ---------------------------------------------------

CONST INT DEX_100_Repair_Clothes		= 40;
CONST INT DEX_100_Repair_Armor_L		= 70;

CONST INT DEX_100_SmithWeapon_Base		= 10;
CONST INT DEX_100_SmithWeapon_Step		= 2;
CONST INT DEX_100_AlchemyPotion_Base	= 20;

 