/**************************************************************************

						УСТАНОВИТЬ ОТНОШЕНИЕ

  B_SetAttitude	(slf,	att)
  Установить отношение att персонажа slf ко всем окружающим.
  
  Задает временное И постоянное отношения.
  
***************************************************************************/


func void B_SetAttitude(var C_Npc slf,var int att)
{
	// установить постоянное отношение
	Npc_SetAttitude(slf,att);
	// установить временное отношение
	Npc_SetTempAttitude(slf,att);
};

