/**************************************************************************

  Хочет ли slf самостоятельно наказать oth за вторжение.
  
  Если ГГ - преступник, на него любой накинется. Для предотвращения.
 
***************************************************************************/


func int C_WantToAttackRoomIntruder(var C_Npc slf)
{
	// ХОЧУ, если я ополченец, паладин, наемник или охотник на драконов, или ГГ - преступник
	if((self.guild == GIL_MIL)
		|| (self.guild == GIL_PAL)
		|| (self.guild == GIL_SLD)
	|| (B_GetPlayerCrime(self) != CRIME_NONE))
	{
		return TRUE;
	};
	
	// в оставльных случаях - НЕ ХОЧУ
	return FALSE;
};

